<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Добро пожаловать!</title>
    <!-- Мета-описание -->
    <meta name="title" content="Заговорить на итальянском">
    <meta name="description" content="Простое приложение выучивания базовых итальянских слов для легкого вхождения в язык">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="white">
    <meta name="mobile-web-app-capable" content="yes">
    <!-- Теги -->
    <meta name="keywords" content="итальянский, слова, учеба, иностранный язык, изучение, Петров, Полиглот">
    <!-- Изображения -->
    <meta property="og:image" content="img/favicon.png">
    <meta property="twitter:image" content="img/favicon.png">
    <!-- Иконки для установки на устройства -->
    <!-- iOS -->
    <link rel="apple-touch-icon" sizes="180x180" href="img/favicon.png">
    <!-- Android -->
    <link rel="icon" type="image/png" sizes="192x192" href="img/favicon.png">
    <!-- Favicon -->
    <link rel="icon" type="image/png" sizes="32x32" href="img/favicon.png">

    <title>Добро пожаловать!</title>
    <link href="css/bootstrap.min.css" rel="stylesheet">
    <link rel="stylesheet" href="css/style.css?version=2.2">
    <script defer type="module" src="js/script.js?version=2.2"></script>
    <!-- Google tag (gtag.js) -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=G-T24M5R7GHF"></script>
    <script>
      window.dataLayer = window.dataLayer || [];
      function gtag(){dataLayer.push(arguments);}
      gtag('js', new Date());

      gtag('config', 'G-T24M5R7GHF');
    </script>
</head>
<body>

    <div class="container">
        <nav class="navbar navbar-expand-lg navbar-light bg-light">
          <a class="navbar-brand" href="Домашняя">&nbsp;</a>
          <button class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
            <span class="navbar-toggler-icon"></span>
          </button>

          <div class="collapse navbar-collapse" id="navbarSupportedContent">
            <ul class="navbar-nav mr-auto">
              <li class="nav-item active">
                <a class="nav-link" href="index.php">🏠 Домашняя</a>
              </li>
              <li class="nav-item">
                <a class="nav-link" href="table.php">📚 Таблицы</a>
              </li>

              <li class="nav-item">
                <a class="nav-link" href="cards.php">🗂️ Карточки</a>
              </li>
              <li class="nav-item ">
                <a class="nav-link" href="topics.php">📖 Топики <span style="color:red; font-weight: bold;"> new!</span> </a>
              </li>
              <li class="nav-item">
                <a class="nav-link" href="donate.php">👍 Поддержать приложение</a>
              </li>
              <li class="nav-item">
                <a class="nav-link" href="settings.php">⚙️ Настройки озвучивания</a>
              </li>
            </ul>
          </div>
        </nav>
        <h1>Ciao дорогие! 👋</h1>
        <p>Это веб приложение для запоминания итальянских слов(планируется добавление других языков) 🇮🇹 <br><br>
            <a target="_blank" href="https://youtu.be/VSgh0XTe1Ig?si=JqMYCZkN5eL6t9iX">Видео о том как эффективнее пользоваться приложением</a><br><br>
            <a target="_blank" href="https://youtube.com/shorts/C9OsCb6YMhs?si=xJ3xDtcgyfXYVcVv">Короткое видео как добавить иконку приложения на экран телефона</a>
        </p>
        <h2>Предистория: 📜</h2>
        <p>На нашем ютюб канале <a href="https://www.youtube.com/channel/UCZZAtmyerOqOgbHlxrpEUvw" target="_blank">"Шестаковы в Италии"</a> мы не однократно рассказывали что начинали изучать итальянский язык по урокам Дмитрия Петрова "Полиглот итальянский за 16 часов", на мой взгляд это лучший метод для вхождения в язык, с тех пор я уже сдал несколько государственных(итальянских) экзаменов.<br>Но есть одно "но" потратить придется значительно больше чем 16 часов, для этого я и сделал это приложение. 🎓</p>
        <h2>Рекомендации по изучению слов: 📚</h2>
        <p>Все слова из уроков нужно заучить, да просто заучить до тех пор когда правильный перевод слова будет приходить в голову моментально, без задержки ни на 1 секунду.<br>У меня уходило 1-2 дня на урок, по 15-20 повторений в день. Нет смысла переходить к следующему уроку, если вы не добились нужного результата на текущем уроке.<br>При запоминании слов нового урока нужно обязательно повторять как минимум по 2 раза в день каждый пройденный урок иначе успеха не будет. При должном упорстве за два месяца можно дойти с 0 до уровня <abbr title="Pre-Intermediate: Вы можете рассказывать о себе, своей семье, профессии, предпочтениях (в музыке, кухни, хобби, время года…). Понимаете, тексты рекламы, объявления в аэропорту, магазине, надписи на продуктах, открытках, знаете, как писать личные и деловые письма. Читать и пересказывать не очень сложные тексты.">A2</abbr> 📖</p>

        <h2>Как пользоваться: 🤔</h2>
        <p>После просмотра занятия переходить на <a href="table.php">страницу с таблицей</a> и выбрать соответствующий урок, повторить все пары слов, обязательно кликая на них, чтоб прослушать произношение, после того как все повторили, переходить на <a href="cards.php">страницу карточек</a>, где непосредственно тренироваться. 🔖
        <br><br><span style="color:red; font-weight: bold;">NEW!</span> <span style="font-weight: bold;">Я реализовал текстовые <a href="topics.php">📖 Топики</a> для чтения с аудио 🔊 прослушиванием. Это то чего мне так не хватало во время изучения, у вас теперь есть! Пополнение текстами возможно только при вашей <a href="donate.php">поддержке 👍</a></span>
             
        </p>
        <h2>Дополнительные рекомендации 🚀</h2>
        <p>Наш 🧠 мозг удивительная штука, так как основная часть всей 🔋 энергии портебляемой нашим организмом приходится именно на его деятельность, ему свойственно лениться и обманывать вас чтоб сэкономить энергию, в процессе обучения вы будете себя подлавливать на самообмане, не поддавайтесь!<br>😊 Эндорфиновый кайф от того что вы начнете понимать, уметь сказать и даже думать на другом языке стоит этих усилий! 👍<br>💡 Дайте мягкий вход своему мозгу - любите 🍽️ кулинарию, 🚗 автомобили, 💻 технообзоры,  🎨 вышивку или рисование, тогда нужно найти на ютюбе каналы на изучаемом языке по 🚴🚴‍♂️🚴‍♀️ соответствующей теме, контекст творит 🌟 чудеса, и мозгу будет интереснее и легче. 🎬 Просмотр фильмов на иностранном оставьте на потом, пока рано.</p>
        <p>Несколько рекомендаций от меня:</p>
        <ul>
            <li><a href="https://www.youtube.com/@GialloZafferanoTV" target="_blank">Кулинария (GialloZafferanoTV)</a></li>
            <li><a href="https://www.youtube.com/@fraffrog" target="_blank">Творчество (fraffrog)</a></li>
            <li><a href="https://www.youtube.com/@overVolt" target="_blank">Технологии (overVolt)</a></li>
            <li><a href="https://www.youtube.com/@marco_romboli" target="_blank">Авиация (marco_romboli)</a></li>
            <li><a href="https://www.youtube.com/@gcnitalia" target="_blank">Велоспорт (gcnitalia)</a></li>
        </ul>
        <h2>Условия пользования: 📝</h2>
        <p>Пользуйтесь с удовольствием, если нашли 🚫 ошикби или неточности можете ✍️ написать мне <a href="mailto:boris@shbb.pro">boris@shbb.pro</a>, код приложения открыт публично, можно делать pull request на <a href="https://github.com/borborich/flipcards">github</a>, при вашей 🤲 <a href="donate.php">поддержке</a> приложение будет развиваться, будут добавлены другие 🗣️ языки, будет сделан личный кабинет, с возможностью добавлять собственные 📋 списки слов и фраз каждому, 🔊 Аудио произношение слов (✅ реализовано). Для вашего комфорта на сайте используется cookies google analytics для анализа посещений, продолжая пользоваться сайтом вы с этим соглашаетесь. 🍪</p>
    </div>

<!--     <div class="container mt-2">
        <div class="row">
            <div class="col text-left">
                <a href="table.php" class="btn btn-secondary">📚 Таблицы</a>
            </div>
            <div class="col text-center">
                <a href="donate.php" class="btn btn-secondary">👍 Поддержать</a>
            </div>            
            <div class="col text-right">
                <a href="cards.php" class="btn btn-secondary">🗂️ Карточки</a>
            </div>
        </div>
    </div> -->
</body>
</html>
